[
  {
    "id": "e5647578-78f5-4669-8488-7f4248dfb0bb",
    "title": "Department of Posts and BSE Sign Landmark MoU to Expand Mutual Fund Access Across India",
    "date": "2025-12-12",
    "category": "Circular",
    "description": "In a major step towards strengthening financial inclusion and expanding access to investment products across the country, the Department of Posts (DoP), Ministry of Communications, Government of India, and BSE, Asia’s oldest stock exchange, signed a landmark Memorandum of Understanding (MoU) on 12 December 2025 in New Delhi. The initiative is in line with the Budget 2025–26 announcement, which emphasized leveraging India Post’s vast postal network as a catalyst for economic activity in rural and semi-urban regions. With its extensive presence across the country, India Post continues to play a pivotal role in deepening financial access and enabling inclusive growth.\n\nThis strategic partnership enables India Post to act as a distributor of mutual fund products through its vast postal network, significantly benefiting citizens in rural, semi-urban, and underserved regions. By combining India Post’s unmatched last-mile presence with BSE Star MF, the country’s largest mutual fund distribution platform, the initiative aims to democratize access to investment opportunities and promote wider participation in financial markets.\n\nThe MoU was formally signed by Ms. Manisha Bansal Badal, General Manager (CCS & RB), Department of Posts, and Shri Sundararaman Ramamurthy, MD & CEO, BSE, in the presence of senior officials from both organisations.\n\nUnder the agreement, selected postal employees will be trained and certified as mutual fund distributors, enabling them to provide investor services and facilitate mutual fund transactions through the BSE StAR MF platform. The MoU will remain valid for three years from 12.12.2025 to 11.12.2028, with provisions for renewal.\n\nAs part of the collaboration, BSE will facilitate the onboarding of eligible and trained postal officials through the generation of Employee Unique Identification Numbers (EUIN) for authorized personnel, ensuring transparent and compliant distribution of mutual fund products. BSE will also support the certification process by enabling postal employees and agents to obtain the mandatory NISM (National Institute of Securities Markets) Mutual Fund Distributor certification. These certified officials, once trained will assist customers with informed investment choices, execute mutual fund transactions, and offer investor support services at the last mile.\n\nThe collaboration highlights the Department of Posts’ efforts to broaden the range of financial services available to the public and strengthen service delivery across the country. It complements BSE’s objective of fostering an efficient and investor-friendly mutual fund ecosystem. With this partnership, India Post will be able to offer customers access to contemporary investment avenues, enhancing its role as a key financial service provider. By integrating BSE’s technology platform with India Post’s widespread presence, the initiative is expected to improve service accessibility, promote investor awareness, and support wider participation in formal financial markets.\n\nImpact of the Initiative\n\nThe partnership is expected to boost mutual fund penetration in Tier-2, Tier-3, and rural areas, encourage informed investment behaviour, and contribute to India’s broader goal of building a financially aware and empowered population.",
    "link": "#"
  },
  {
    "id": "32b9ba83-e338-4ee1-a66e-1e606e6c2373",
    "title": "Resolution on Regularisation of Gramin Dak Sevaks and Inclusion of GDS in the 8th CPC Purview.",
    "date": "2025-12-11",
    "category": "Circular",
    "description": "ALL INDIA GRAMIN DAK SEVAKS UNION (AIGDSU)\n\nCentral Head Quarters, Padam Nagar, Delhi-110007.\n\n \n\nPresident: B. Venkateshwarlu.\n\nOff. General Secretary: C.K. Subramani\n\n \n\nRef No.: GDS/CHQ/CWC/1/3/2025                                    Date: 09-12-2025\n\n \n\nTo,\n\n \n\nThe Secretary,\n\nDepartment of Posts, Dak Bhawan, New Delhi-110001\n\n \n\nSub: Resolution on Regularisation of Gramin Dak Sevaks and Inclusion of GDS in the 8th CPC Purview.\n\n \n\nRespected Madam,\n\n              The Central Working Committee of AIGDSU, in its meeting held at New Delhi on 4th December 2025, adopted a resolution urging the Government and the Department to regularise all Gramin Dak Sevaks and to bring them under the purview of the 8th Central Pay Commission.Postal Savings Schemes\n\n \n\n               The Committee has clearly recorded that GDS continue to perform core departmental duties across rural India, yet remain outside the framework of regular service conditions, social security, and wage revision mechanisms.\n\n \n\n                The approved resolution is enclosed for consideration, as the matter carries significant implications for service delivery, workforce stability, and the welfare of lakhs of GDS who sustain postal operations in remote areas.\n\n \n\nWe, therefore, request necessary action for inclusion of GDS in the 8th CPC and steps towards full regularisation.\n\n \n\nWith high regards,\n\n \n\nYours faithfully,\n\n \n\nC. K. Subramani\n\nOff. General Secretary",
    "link": "#"
  },
  {
    "id": "fe693d88-de29-4c93-9f83-fa54f8d51f32",
    "title": "Department of Posts has been taking multiple measures to prevent any potential leakage of revenue",
    "date": "2025-12-11",
    "category": "Circular",
    "description": "Series of meetings have been held at different levels including a meeting chaired by the Minister of State for Communications\nPosted On: 10 DEC 2025 4:53PM by PIB Delhi\nA series of meetings have been held at different levels including a meeting chaired by the Minister of State for Communications. Operational and fraud risks in different services have been identified based on available information. Broadly, deficiency in postage realization, use of used up/ fake stamps, no or less postage in pre-paid articles, infringement of conditions in registered news paper etc.\n\nThe following steps have been taken to prevent any potential leakage of revenue: -\n\ni) Based on volumes of mail and parcel bookings and assessment of financial services for vulnerability to leakage of revenue, post offices have been categorised to strengthen oversight.\n\n(ii) Preventive processes to avoid recurrence of any frauds through analysis of identified modus operandi have been introduced.\n\n(iii) An alerts-based risk management system has been strengthened.\n\nThe Department is continuously strengthening oversight and risk management with use of technology and data analytics and transactions driven alerts to prevent any potential loss and deviation from prescribed processes, creating end to end online processes to grant licence to registered news paper etc.\n\nStrengthening of oversight through corrective and preventive measures is an ongoing process. Necessary steps with the help of experts and advanced technology are being progressively taken by the Department to improve its revenue performance.\n\nThis information was given by the Minister of State for Communications and Rural Development Dr. Pemmasani Chandra Sekhar in a written reply to a question in the Lok Sabha today.\n\n*****",
    "link": "https://www.pib.gov.in/PressReleasePage.aspx?PRID=2201563&reg=3&lang=1"
  },
  {
    "id": "fce91864-a82e-44ff-b8fa-7298f6ec9c15",
    "title": "LDCE for promotion to the cadre of PS Group \"B\" for the vacancy year 2021, 2022 & 2023-Withdrawal/Restoration-regarding",
    "date": "2025-12-11",
    "category": "Circular",
    "description": "LDCE for promotion to the cadre of PS Group \"B\" for the vacancy year 2021, 2022 & 2023-Withdrawal/Restoration-regarding\n",
    "link": "https://utilities.cept.gov.in/dop/pdfbind.ashx?id=14404"
  },
  {
    "id": "1",
    "title": "Revision of Interest Rates for Small Savings Schemes",
    "date": "2025-12-01",
    "category": "Order",
    "description": "The Ministry of Finance has revised the interest rates for various Small Savings Schemes for the quarter starting January 1, 2026.",
    "link": "#"
  },
  {
    "id": "2",
    "title": "Guidelines for Online GDS Engagement - Schedule I (January 2026)",
    "date": "2025-11-28",
    "category": "Notification",
    "description": "Comprehensive guidelines issued for the upcoming GDS engagement cycle, including eligibility criteria and selection process.",
    "link": "#"
  },
  {
    "id": "3",
    "title": "Clarification on compassionate appointment rules",
    "date": "2025-11-15",
    "category": "Circular",
    "description": "Department has issued clarifications regarding the point-based system for compassionate appointments.",
    "link": "#"
  }
]