[
  {
    "q": "Under Section 22 of the CAT Act, 1985, Tribunals are primarily guided by:",
    "o": [
      "The Bharatiya Nagarik Suraksha Sanhita 2023",
      "Code of Civil Procedure, 1908",
      "Bharatiya Nyaya Sanhita, 2023 (BNS)",
      "Principles of natural justice"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "The Preamble of the Indian Constitution declares India in the correct order as:",
    "o": [
      "Sovereign, Socialist, Secular, Democratic, Republic",
      "Sovereign, Secular, Socialist, Democratic, Republic",
      "Socialist, Secular, Democratic, Republic",
      "Sovereign, Democratic, Socialist, Secular, Republic"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The Central Administrative Tribunal (CAT) was established under which Article of the Constitution?",
    "o": [
      "Article 323A",
      "Article 226",
      "Article 227",
      "Article 323B"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under Bharatiya Nagarik Suraksha Sanhita, 2023, a cognizable offence is one in which:",
    "o": [
      "Police may arrest without warrant",
      "Police cannot register FIR without Magistrate's permission",
      "It is always bailable",
      "Only the High Court can take cognizance"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The Bharatiya Nagarik Suraksha Sanhita 2023 was enacted by the Parliament in the",
    "o": [
      "74th year of the Republic of India",
      "75th year of the Republic of India",
      "73rd year of the Republic of India",
      "72nd year of the Republic of India"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The objectives mentioned in the Preamble to the Constitution of India are:",
    "o": [
      "Justice, Liberty, Equality, Fraternity",
      "Justice, Liberty, Sovereignty, Democracy",
      "Justice, Secularism, Federalism, Integrity",
      "Liberty, Democracy, Socialism, Integrity"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "A summons-case under Bharatiya Nagarik Suraksha Sanhita, 2023 refers to:",
    "o": [
      "A case relating to an offence punishable with fine only",
      "A case where FIR cannot be filed",
      "A case triable only by Sessions Court",
      "A case not being a warrant-case"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "For societies and local authorities owned or controlled by the Central Government, the CVC covers officials drawing a salary of at least:",
    "o": [
      "₹6,500 per month",
      "₹7,600 per month",
      "₹8,700 per month",
      "₹10,000 per month"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The age of retirement of a High Court judge is:",
    "o": [
      "62 years",
      "60 years",
      "65 years",
      "68 years"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The Supreme Court shall have power to issue directions or orders or writs, including writs in the nature of habeas corpus, mandamus, prohibition, quo warranto and certiorari, whichever may be appropriate, for the enforcement of any of the rights conferred by this Part under which section of Constitution of India.",
    "o": [
      "Section 32(1)",
      "Section 32(4)",
      "Section 32(3)",
      "Section 32(2)"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Expenditure from public money should not be incurred for the benefit of a particular person or a section of the people, unless -",
    "o": [
      "The expenditure is not in pursuance of a recognised policy or custom",
      "The expenditure should not be prima facie more than the occasion demands",
      "A claim for the amount could be enforced in a court of Law",
      "All of the above"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Under Section 84 of the Bharatiya Nagarik Suraksha Sanhita 2023, a proclamation for a person absconding can be issued when:",
    "o": [
      "The person has been convicted by a Court",
      "The person is suspected of a crime",
      "The person is absconding or concealing himself to avoid execution of a warrant",
      "The person has filed an appeal"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The term \"tribal areas\" in Bharatiya Nagarik Suraksha Sanhita, 2023 refer",
    "o": [
      "All Scheduled Tribes regions in India",
      "Territories that were tribal areas of Nagaland before 21st January 1972, excluding Kohima municipality",
      "Territories that were tribal areas of Assam before 21st January 1972, excluding Shillong municipality",
      "Territories that were tribal areas of Manipur before 21st January 1972, excluding Imphal municipality"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which Article directs the State to promote international peace and security?",
    "o": [
      "Article 48",
      "Article 50",
      "Article 51",
      "Article 52"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "What are the five parameters known as the Five R's of Procurement.",
    "o": [
      "Right Quality, Right Quantity, Right Price, Right Time and Place and Right Source",
      "Right Quality, Right Quantity, Right Amount, Right Time and Place and Right process",
      "Right Quality, Right Measure, Right Price, Right Time and Place and Right output",
      "Right standard, Right Quantity, Right Price, Right Time and Place and Right performance"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which of the following Rules lay down the Fundamental Principles of Public Procurement?",
    "o": [
      "Rule 143 of GFR 2017",
      "Rule 146 of GFR 2017",
      "Rule 145 of GFR 2017",
      "Rule 144 of GFR 2017"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "If any question arises as to whether a particular matter falls within the purview of the business allocated to a bench of a CAT, whose decision shall be final?",
    "o": [
      "The High Court",
      "The Member of the Tribunal",
      "The Supreme Court",
      "The Chairman of the Tribunal"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which of the following is correct regarding electronic communication in Bharatiya Nagarik Suraksha Sanhita, 2023?",
    "o": [
      "Includes any written, verbal, pictorial or video information, transmitted through electronic devices",
      "Limited only to telephone, email and pager communication",
      "Limited only to Messages sent between two persons directly",
      "Audio/Visual recordings which is only stored in a device."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which of the following does NOT fall under \"complaint\" as per Bharatiya Nagarik Suraksha Sanhita, 2023?",
    "o": [
      "Allegation made orally to a Magistrate about an offence",
      "Allegation made in writing to a Magistrate about an offence",
      "Police report in a non-cognizable case disclosing offence",
      "Police report after investigation of a cognizable case"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which of the following is NOT an exception to the requirement of inquiry under Article 311(2) of Constitution of India?",
    "o": [
      "Conviction on a criminal charge",
      "If it is satisfied that in the interest of the security of the State it is not expedient to hold such inquiry",
      "If it satisfied that it is not practicable to hold an enquiry",
      "Administrative transfer to a lower post"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "According to the amended Public Procurement Policy for MSEs Order 2012, what is the minimum percentage of their annual value of goods or services that should be procured by Central Government Ministries/ Departments/ PSUs from Micro and Small Enterprises (MSES)?",
    "o": [
      "25%",
      "20%",
      "30%",
      "35%"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The term of office of Chairman of Central Administrative Tribunal is:",
    "o": [
      "3 years and until he attains 60 years of age",
      "4 years and until he attains 62 years of age",
      "6 years and until he attains 65 years of age",
      "5 years and until he attains 68 years of age"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Under Article 311(3) of the Constitution, whose decision is treated as final when a question arises about the practicability of holding an inquiry under clause (2)?",
    "o": [
      "The decision of the President of India will be treated as final when a question arises regarding whether it is reasonably practicable to hold an inquiry.",
      "The decision of the Inquiring Authority will be treated as final when a question arises regarding whether it is reasonably practicable to hold an inquiry.",
      "The decision of the authority empowered To dismiss, remove or reduce the rank of the employee, will be treated as final when a question arises regarding whether it is reasonably practicable to hold an inquiry.",
      "None of the above."
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "A warrant-case under Bharatiya Nagarik Suraksha Sanhita, 2023 is related to:",
    "o": [
      "A case relating to an offence punishable with fine only or imprisonment not exceeding two years",
      "A case relating to an offence triable and punishable by a Magistrate as a summons case.",
      "A case relating to an offence triable and punishable by a Sessions court with fine or imprisonment less than one year.",
      "A case relating to an offence punishable with death, imprisonment for life or imprisonment for a term exceeding two years."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Who called Article 32 the \"heart and soul\" of the Constitution?",
    "o": [
      "B.R. Ambedkar",
      "Mahatma Gandhi",
      "Jawaharlal Nehru",
      "Dr. Rajendra Prasad"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "According to Section 20(1) of CAT Act, ordinarily a Tribunal shall not admit an application unless:",
    "o": [
      "The applicant has exhausted all remedies available under service rules",
      "The applicant has filed a revision petition before the competent authority",
      "A final order rejecting his appeal or representation has been passed by the competent authority.",
      "If no final order is passed on an appeal or representation"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which Article of the Indian Constitution declares that the State shall endeavour to provide a Uniform Civil Code?",
    "o": [
      "Article 39",
      "Article 40",
      "Article 44",
      "Article 50"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The provisions of Bharatiya Nagarik Suraksha Sanhita, 2023 (except Chapters IX, XI, XII) do not automatically apply to:",
    "o": [
      "The state of Jammu & Kashmir and the tribal areas",
      "The state of Arunachal Pradesh, Nagaland and the tribal areas",
      "U.T of Lakshadweep, Andaman & Nicobar Islands and the tribal areas",
      "The state of Nagaland and the tribal areas"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "For the purpose of contempt proceedings under Section 17 CAT Act, provisions of which Act are applicable?",
    "o": [
      "Bharatiya Nyaya Sanhita, 2023",
      "Bharatiya Sakshya Adhiniyam, 2023",
      "The Bharatiya Nagarik Suraksha Samhita 2023",
      "Contempt of Courts Act, 1971"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Article 214 of the Constitution provides for:",
    "o": [
      "Establishment of the Supreme Court",
      "Tribunals for special cases",
      "District Courts in each State",
      "High Court for each State"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "The additional Fundamental Duty 51A(k) was added by which Constitutional Amendment?",
    "o": [
      "42nd Amendment",
      "44th Amendment",
      "86th Amendment",
      "92nd Amendment"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Article 32 falls under which part of the Constitution?",
    "o": [
      "Part II",
      "Part V",
      "Part IV",
      "Part III"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Article 39 clause (d) which is a part of the Directive Principles of State Policy specifically directs the State to ensure that",
    "o": [
      "Equal pay for equal work for both men and women",
      "Free legal aid and equal justice for the poor",
      "Organization of agriculture and animal husbandry",
      "Promotion of international peace"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Who recommended the inclusion of Fundamental Duties in the Constitution?",
    "o": [
      "Sarkaria Commission",
      "Swaran Singh Committee",
      "Balwant Rai Mehta Committee",
      "None of the above"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Article 338B of the Constitution deals with:",
    "o": [
      "National Commission for Scheduled Castes",
      "National Commission for Scheduled Tribes",
      "National Commission for Backward Classes",
      "National Human Rights Commission"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Section 6 of the Revenue Recovery Act deals with property liable to sale. Which of the following statements is correct under that section?",
    "o": [
      "The Collector may issue a proclamation prohibiting the transfer or charge of immovable property of the defaulter",
      "Immovable property of the defaulter in any district cannot be touched for recovery",
      "Any private alienation by purchase of property after such proclamation gains full legal title unaffected by the recovery process",
      "Any encumbrances created, grants made or contract entered even in good faith shall be rendered invalid"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "If a person denies liability to pay the amount stated in a certificate under Section 3 of the Revenue Recovery Act, what remedy does the Act provide under Section 4?",
    "o": [
      "The person may pay under protest in writing and institute a suit in the appropriate civil court",
      "A person is liable to pay as denial is not allowed under the Act",
      "The person need not pay the amount and has to wait for further orders from the higher authority",
      "The person can only appeal to the Collector issuing the certificate"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under Rule 8 of GPF (CS) Rules, 1960 regarding the rates of subscription to the Government Contributory Provident Fund, which of the following statements is correct?",
    "o": [
      "A subscriber can fix subscription amount at any fraction of a rupee without rounding",
      "The minimum subscription is 4% of emoluments for all subscribers has to be deducted without fail",
      "The subscription may be reduced once or enhanced twice in a year, subject to the prescribed minimum",
      "Subscribers cannot change the subscription amount once fixed at the beginning of the year"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Because of the Principal / Employer-Agent relationship, the Procuring Entity (Employer) may be:",
    "o": [
      "Vicariously legally and financially liable for its actions of the contractor",
      "Only morally liable for the contractor's actions in execution of the contract",
      "Free from any liability once a contract is signed and the work have started",
      "Required to indemnify the contractor against all losses suffered during the course of the work entrusted"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Section 20 of Prevention of Corruption Act primarily deals with which legal concept?",
    "o": [
      "Presumption where the burden of proof is on the accused",
      "Mandatory minimum punishment for two years which may extend upto seven years and shall also be liable to fine",
      "Accused person shall also be competent witness for the defence",
      "Presumption where a public servant accepts any undue advantage"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Who is qualified to be appointed as a Special Judge under the Prevention of Corruption Act, 1988?",
    "o": [
      "A person who is or has been a Sessions Judge",
      "A person who is or has been an Additional Sessions Judge",
      "A person who is or has been an Assistant Sessions Judge",
      "Either (A) or (B) or (C)"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which of the following is NOT a criterion for an organisation to qualify as a \"public authority\" under Section 2(h) of RTI Act?",
    "o": [
      "Established by or under the Constitution",
      "Substantially financed, directly or indirectly, by funds provided by the appropriate Government.",
      "Registered under the Societies Registration Act, 1860, without any government control or funding.",
      "Constituted by a notification or order of the appropriate Government."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "What is the minimum number of instalments in which an advance may normally be recovered under Rule 13 of GPF (CS) Rules, 1960?",
    "o": [
      "6",
      "12",
      "24",
      "36"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "When a PIO intends to disclose information treated as confidential by a third party, within how many days must written notice be served to that third party under RTI Act 2005?",
    "o": [
      "Within 5 days of receipt of the request",
      "Within 2 days of receipt of the request",
      "Within 7 days of receipt of the request",
      "Within 10 days of receipt of the request"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under Rule 8 of the RTI Rules 2012, which of the following documents must accompany an appeal to the Information Commission?",
    "o": [
      "Only a copy of the original RTI application submitted to the CPIO/SPIO",
      "A copy of the RTI application, reply from CPIO/SPIO, appeal to First Appellate Authority, order from First Appellate Authority (if any), copies of other relied documents, and an index of documents",
      "Only the appeal made to the First Appellate Authority is required to accompany an appeal to the Information Commission",
      "Only the documents referred to in the appeal"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Within how many days must the Head of Office or Head of Department request the medical authority to examine the Government servant after receiving an application for invalid pension under CCS Pension Rules?",
    "o": [
      "Within 7 days of receipt of application",
      "Within 15 days of receipt of application",
      "Within 30 days of receipt of application",
      "Within 45 days of receipt of application"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Information received in confidence from a foreign government is exempt under RTI Act, 2005. Under which clause of Section 8(1) does this fall?",
    "o": [
      "Clause (d)",
      "Clause (i)",
      "Clause (g)",
      "Clause (f)"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Within how many months must the competent authority decide on the grant of compassionate allowance after issuing the order of dismissal or removal under CCS Pension Rules?",
    "o": [
      "One month",
      "Three months",
      "Six months",
      "Twelve months"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "According to Section 3 of the Revenue Recovery Act, when an arrear of land-revenue is payable to a Collector by a defaulter who has property in another district, the Collector may:",
    "o": [
      "Report the matter to the Chief Secretary of the state with a certificate of arrears due, to cause recovery of the same",
      "Refer the case to the High court with a certificate of arrears due to initiate recovery proceedings for the recovery of the sum accrued",
      "Only recover the arrears from the properties within his own district",
      "Send a certificate to the Collector of the other district to recover the sum as if it is accrued there"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "The Preamble of the RTI Act 2005 has established:",
    "o": [
      "A socialist secular republic",
      "A welfare state with equal rights",
      "A democratic Republic",
      "A federation of autonomous states"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "How long does a second appeal lie with the Central or State Information Commission under RTI Act 2005?",
    "o": [
      "30 days from filing the first appeal or date of receipt of the appellate order by the appellant",
      "45 days from the date of filing of the first appeal or the date of receipt of the appellate order by the appellant",
      "60 days from the date of filing of the RTI request or the date of receipt of the appellate order by the appellant",
      "90 days from the date the decision should have been made by the first appellate authority or was actually received by the appellant"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Under the mitigation rules for gifts, what is the correct mandatory action if a public servant unintentionally receives a gift that may exceed the value permitted under the Conduct of public servants in Public Procurement?",
    "o": [
      "Retain the gift temporarily after making an immediate written intimation to the competent authority and disclose it in the next property return.",
      "Retain the gift only if a competent authority certifies that it does not create a conflict of interest, and record it in the annual immovable property statement",
      "Forward the gift to the department's internal audit wing for valuation and await instructions before taking further steps.",
      "Return the gift to the giver or report it without delay and deposit it in the Toshakhana / Treasury through proper channel."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Section 19 of the Prevention of Corruption Act primarily deals with:",
    "o": [
      "Presumption of bribery of public servant",
      "Power to investigate without warrant against public servant",
      "Confiscation of property of public servant",
      "Previous Sanction for prosecution of public servant"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "As per Manual for Procurement of Consultancy & Other Services, hiring of external professionals or consultancy firms for a specific, well-defined job when in-house expertise is lacking, is permitted under?",
    "o": [
      "Rule 159 & 161 of GFR Rules 2017",
      "Rule 165 & 170 of GFR Rules 2017",
      "Rule 178 & 180 of GFR Rules 2017",
      "Rule 190 & 192 of GFR Rules 2017"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "According to Rule 8(6) of CCS Pension Rules 2021, if the competent authority orders recovery of pecuniary loss from a pensioner without withholding or withdrawing the pension, the recovery:",
    "o": [
      "Shall not ordinarily exceed one-fourth of the pension admissible on the date of retirement",
      "Shall not ordinarily exceed one-half of the pension admissible on the date of retirement",
      "Shall be deferred until the pensioner is re-employed",
      "Shall not ordinarily exceed one-third of the pension admissible on the date of retirement"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Before a government entity procures directly from the market (not through GeM), which mandatory document must be generated according to Manual for Procurement of Goods?",
    "o": [
      "Bid Security Declaration and validation",
      "Performance Security Certificate or Bank Guarantee",
      "GeM Availability Report & Past Transaction Summary",
      "Integrity Pact Compliance Certificate"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "According to Rule 8 of the CCS (Pension) Rules, 2021, who can order withholding or withdrawal of pension in case of a pensioner who retired from a post for which an authority subordinate to the President is the Appointing authority?",
    "o": [
      "Only the Hon'ble President of India has powers to withhold pension",
      "Disciplinary authority who has powers to impose penalty against the Government servant",
      "Head of the office or an officer above the rank of the head of the office",
      "Secretary of the Administrative Ministry or Department"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which statement is TRUE about electronic Bank Guarantees?",
    "o": [
      "They are easier to verify than physical BGS",
      "They do not require any verification",
      "They can be accepted without any official confirmation",
      "They shall not be as per any prescribed format"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The procedure for retirement under Rule 42 of CCS Pension Rules is:",
    "o": [
      "As laid down by Department of Personnel and Training for retirement under Rule 56 of the Supplementary Rules, 1922.",
      "As laid down by Department of Personnel and Training for retirement under Rule 56 of the Fundamental Rules, 1922",
      "Central Civil Services (Classification, Control and Appeal) Rules, 1965",
      "None of the above"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under the RTI Rules, 2012, regarding the process of appeal to the Commission, which of the following statements is correct?",
    "o": [
      "The Commission can dismiss an appeal solely because it was not filed in the specified format without giving the appellant any opportunity of being heard and recording reasons.",
      "All appeals must be automatically admitted regardless of merit or format.",
      "The appeal can be dismissed without any notice or opportunity to the appellant.",
      "The Commission may dismiss an appeal if it is not satisfied it as a fit case, after giving the appellant an opportunity of being heard and recording reasons."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "According to GFR 2017, which of the following sections is NOT a mandatory part of a tender document?",
    "o": [
      "Instructions to Bidders",
      "Schedule of Requirements",
      "Pre-NIT Market Survey Report",
      "Special Conditions of Contract"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Under Rule 14 of GPF (CS) Rules 1960, if the sanctioning authority suspects wrongful use of an advance, what is the first action to be taken?",
    "o": [
      "Immediately recover the full amount from the subscriber and call for his explanation",
      "Refer the matter to the Accounts Officer",
      "Payment of further advances will be barred in future without assigning any reasons whatsoever",
      "Communicate the reasons for doubt and require the subscriber to explain in writing within 15 days"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which rule of GFR 2017 mandates the Code of Integrity for Public Procurement?",
    "o": [
      "Rule 173",
      "Rule 174",
      "Rule 175",
      "Rule 176"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which of the following statement is correct?",
    "o": [
      "Prevention of Corruption Act 1988 extends to the whole of India except the state of Jammu and Kashmir and it applies only to citizens residing within India",
      "Prevention of Corruption Act 1988 extends to the whole of India except the state of Nagaland and it applies only to citizens residing within India",
      "Prevention of Corruption Act 1988 extends to the whole of India and it applies only to the citizens of India within India",
      "Prevention of Corruption Act 1988 extends to the whole of India and it applies also to all citizens of India outside India"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Penalty for the offence relating to public servant being bribed under Prevention of Corruption Act is",
    "o": [
      "Imprisonment for a term which shall not be less than five years but which may extend to seven years and shall also be liable to fine.",
      "Imprisonment for a term which shall not be less than two years but which may extend to five years and shall also be liable to fine.",
      "Imprisonment for a term which shall not be less than three years but which may extend to seven years and shall also be liable to fine.",
      "Imprisonment for a term which shall not be less than one year but which may extend to five years and shall also be liable to fine."
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "In contracts that involve Supply, Installation, Testing and Commissioning (SITC) of goods, which of the following correctly describes the first milestone payment?",
    "o": [
      "100% of basic goods price + 100% GST, in addition to all installation & commissioning charges",
      "90% of total contract value including services and installation & commissioning charges",
      "80-90% of basic goods price + 100% GST on goods, excluding installation/commissioning charges",
      "50% of basic goods price only, GST withheld until installation"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which of the following is NOT advisable when dealing with Abnormally Low Bids?",
    "o": [
      "Fixing a normative percentage below the estimated cost to automatically mark bids as abnormally low.",
      "Taking care while formulating specifications at the time of preparation of tender documents against the submission of abnormally low awe bid",
      "Seeking written clarifications and detailed price analysis of its bid price in relation to the scope, schedule, allocation of risks and responsibilities etc from the bidder",
      "Evaluating the next higher bidder if the abnormally low bid is rejected"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "According to the Manual for Procurement of Goods, once a Conflict of Interest is declared, the competent authority may:",
    "o": [
      "Evaluate the level of Conflict of Interest and either allow continuation or nominate an alternate officer",
      "Suspend all procurement process",
      "Refer the matter to the Comptroller and Auditor General of India for a decision before proceeding",
      "Mandate disciplinary action against the officer concerned and blacklist the concerned bidder from all future procurement process for five years"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The Prevention of Corruption Act, 1947 was amended in 1964 based on the recommendations which committee?",
    "o": [
      "Santhanam Committee",
      "Vohra Committee",
      "Shah Commission",
      "Wanchoo Committee"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under RTI Rules, 2012, which of the following persons is exempted from paying the application fee?",
    "o": [
      "Persons below the poverty line (BPL) submitting the certificate issued by the appropriate Government.",
      "Any government employee who has a valid disability certificate having disability more than 40% obtained from valid medical board.",
      "Any citizen belonging to SC/ST category and possess a valid certificate in this regard.",
      "Senior citizens above 65 years."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which of these is not a principle emphasized under Rule 21 of GFR",
    "o": [
      "Sanctioning expenditure that benefits a particular person arbitrarily.",
      "Ensuring expenditure is not more than what the occasion demands.",
      "Exercising vigilance as for one's own money.",
      "Following relevant financial rules in one's office and subordinate offices."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "If the percentage of pension chosen for commutation results in a fraction of a rupee, how is this handled under CCS (Commutation of Pension) Rules?",
    "o": [
      "Rounded to the next higher rupee",
      "Rounded to the nearest rupee",
      "Ignored for the purpose of commutation",
      "Added to the commutation amount in the next payment"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Rule 29 of General Financial Rules 2017 relates to",
    "o": [
      "Procedure for communication of sanctions",
      "Provision of funds for sanction",
      "Delegation of Financial powers",
      "Expenditure from Public Funds"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under CCS Pension Rules, dependent siblings are eligible for family pension only if:",
    "o": [
      "They are unmarried",
      "They have mental or physical disability",
      "They are below 25 years",
      "They are not adopted"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "When a Reporting or Reviewing Officer is under suspension at the time an Annual Performance Appraisal Report (APAR) is due, which of the following statements is correct?",
    "o": [
      "The officer under suspension can write/review the APAR within three months from the date of suspension or within 45 days from the due date of the APAR, whichever is later.",
      "The officer under suspension must write/review the APAR within two months from the date of suspension or within one month from the due date of the APAR, whichever is later.",
      "The APAR cannot be written/reviewed at all if the officer is under suspension.",
      "The APAR should be automatically marked as \"Not Reviewed\" if the officer is under suspension"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "What is the effect of compulsorily retirement, dismissal, or removal from government service under CCS (Implementation of National Pension System) Rules 2021?",
    "o": [
      "The subscriber loses the entire NPS corpus, and it is forfeited to the Government as a penalty for dismissal, compulsory retirement, or removal, with no amount payable to the subscriber or nominee.",
      "The lumpsum and annuity out of his accumulated pension corpus shall be paid to him in accordance with the regulations notified by the Authority payable to the subscriber as admissible in the case of exit of a subscriber from the National Pension System before superannuation, provided he at his option may continue to subscribe to the NPS with the same Permanent Retirement Account number as a non-Government Subscriber.",
      "The subscriber receives only the lump sum amount from the accumulated pension corpus at the time of exit under NPS regulations, but does not receive any annuity payments as pension benefits, as annuities are not provided in cases of dismissal or compulsory retirement even if he opted to continue to subscribe to the NPS with the same Permanent Retirement Account number as a non Government Subscriber.",
      "The payment of the entire NPS accumulated pension corpus is deferred by the Government until the subscriber reaches the age of superannuation (retirement age), and no immediate payment or annuity is granted on compulsory retirement, dismissal, or removal from service."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under FR 56(j), the appropriate authority may retire a Group C employee in public interest after he/she has:",
    "o": [
      "Attained the age of 55 years",
      "Attained the age of 50 years",
      "Attained the age of 60 years",
      "None of the above"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "A retired government servant becomes 85 years old. What is the additional pension or compassionate allowance payable to him under CCS Pension Rules 2021?",
    "o": [
      "20% of basic pension/ compassionate allowance",
      "30% of basic pension/ compassionate allowance",
      "40% of basic pension/ compassionate allowance",
      "50% of basic pension/ compassionate allowance"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "On the death of an NPS subscriber, if benefits are payable to the family under the CCS (Extraordinary Pension) Rules, 1939 or CCS (Pension) Rules, 1972, the accumulated pension corpus is handled in which of the following ways?",
    "o": [
      "The entire accumulated pension corpus, including the Subscriber's contributions, the Government's contribution, and the returns earned thereon, is paid in full and in a lump sum entirely to the nominee registered under the NPS scheme, without any portion being transferred back to the Government or withheld, irrespective of whether the subscriber had exercised any option for old pension scheme benefits.",
      "The Government contribution and returns thereon in the accumulated pension corpus of the subscriber shall be a transferred to Government account, and the remaining accumulated pension corpus shall be paid to the nominee in lumpsum if no valid nomination exists, it is paid to the legal heirs.",
      "The entire accumulated pension corpus comprising both the subscriber's and Government's contributions and all returns accrued thereon is transferred outright to the Government account, with no amount payable either to the nominee or legal heirs, as per the policy that the Government retains full rights to the corpus on account of payment of family pension and benefits under CCS rules.",
      "The accumulated corpus is equally divided between Government account and nominee."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "How is a fraction of a year equal to three months or more treated while calculating qualifying service for retirement or gratuity under Rule 45 of CCS Pension Rules?",
    "o": [
      "Ignored completely for reckoning the qualifying service",
      "Treated as a full year and reckoned as the qualifying service",
      "Treated as a completed six-monthly period and reckoned as qualifying service",
      "Treated as completed three months and reckoned as qualifying service"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "If a pensioner's pension was revised upward and commutation amount was paid on more than one occasion, when will the respective commuted portion be restored under CCS (Commutation of Pension) Rules?",
    "o": [
      "Completion of 12 years from the respective date(s)",
      "Completion of 10 years from the respective date(s)",
      "Completion of 15 years from the respective date(s)",
      "Completion of 20 years from the respective date(s)"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Under which rule of the General Financial Rules it is mandated that all money received by or on behalf of the Government must be credited to the Government account without delay in accordance with Articles 150 and 283(1) of the Constitution?",
    "o": [
      "Rule 5",
      "Rule 7",
      "Rule 10",
      "Rule 15"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Which of the following is not true about resignation from Government service as per CCS (Implementation of National Pension System) Rules 2021?",
    "o": [
      "The lumpsum and the annuity out of the subscriber's accumulated pension corpus shall be paid to him in accordance with the regulations notified by the Authority as admissible, provided that such payment of lump sum withdrawal and annuity shall not be made before the expiry of a period of ninety days from the date on which the resignation becomes effective and the subscriber is relieved of his duty.",
      "The lumpsum and the annuity out of the subscriber's accumulated pension corpus shall be paid to the person eligible to receive such payment immediately if the subscriber dies before the expiry of a period of ninety days from the date on which the resignation becomes effective.",
      "The accumulated pension corpus in the subscriber's NPS account is not immediately disbursed. Instead, this accumulated corpus including both the subscriber's own contributions and the Government's contributions along with returns earned on both is effectively frozen or retained in the account until the date on which the subscriber would have ordinarily reached the age of superannuation",
      "The appointing authority may permit a person to withdraw his resignation in the public interest under certain conditions stipulated in Rule 14(3) of CCS (Implementation of National Pension System) Rules, 2021."
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Under Rule 48 of the CCS (Pension) Rules, 2021, if a person who is eligible for gratuity is convicted of murdering or abetting the murder of a government servant, what happens to their entitlement?",
    "o": [
      "They receive a reduced gratuity equal to one- half of their share and rest payable to other eligible family members, if any",
      "They are debarred from receiving their share, which is payable to other eligible family members, if any",
      "They receive a reduced gratuity equal to one-third of their share and rest payable to other eligible family members, if any",
      "The gratuity is forfeited to the Government"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Judicial proceedings shall be deemed to be pending for the purpose of Rule 43(3) of CCS Pension Rules 2021 if:",
    "o": [
      "A complaint or report of a police officer has been made, of which the Magistrate takes cognizance, has been made or filed in a criminal proceedings",
      "A departmental inquiry has been initiated and disciplinary proceedings are pending against the Government servant",
      "The Government servant is under suspension and disciplinary case has been initiated but the disciplinary proceedings are pending",
      "The Government servant has filed a case under administrative Tribunals Act 1985"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "When is the qualifying service of a government servant required to be verified as per the Central Civil Services (Payment of Gratuity under National Pension System) Rules, 2021?",
    "o": [
      "Only once, at the time of retirement.",
      "After completion of eighteen years of service and again when five years remain before superannuation, or when transferred from a temporary department, department closure, or surplus post.",
      "After completion of twelve years of service and again when five years remain before superannuation or when transferred from a temporary department, department closure, or surplus post.",
      "After completion of fifteen years of service and again when five years remain before superannuation, or when transferred from a temporary department, department closure, or surplus post."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under CCS (Commutation of Pension) Rules, when the documents are returned to the Head of Office due to the applicant's unjustified absence at the medical examination, the commutation application is -",
    "o": [
      "Deferred until further notice",
      "Approved with a penalty",
      "Treated as withdrawn",
      "Forwarded to the Pension Sanctioning Authority for reconsideration"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "In the absence of a Reporting Officer with the requisite experience for initiation of the Report, which of the following statements is/are correct regarding initiation of the Report?",
    "o": [
      "The Reviewing Officer may initiate the Report as Reporting Officer only if he has been the Reviewing Officer for the entire period and can fill in all columns, and must submit it to his own superior for review if one exists.",
      "The Reviewing Officer may initiate the Performance Appraisal Report even if he has not held the position of Reviewing Officer for the entire reporting period, provided that he has overseen the officer reported upon for some portion of that period.",
      "The Report may be prepared by any officer in the same cadre as the absent Reporting Officer.",
      "The Performance Appraisal Report may be prepared by any other officer belonging to the same cadre as the absent Reporting Officer, irrespective of whether he was directly supervising the work of the officer reported upon."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which section of the Pension Fund Regulatory and Development Authority Act, 2013 is specifically referred to in the definition of the National Pension System?",
    "o": [
      "Section 10",
      "Section 15",
      "Section 20",
      "Section 25"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Under CCS Pension Rules, if a government servant dies leaving no family and no valid nomination, the gratuity shall:",
    "o": [
      "Lapse to the Government",
      "Be paid to the nearest relative producing his identity certificate",
      "Be paid to the Head of Department",
      "Be automatically transferred to the public fund"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under GFR Rule 172(1), the maximum advance payment permitted to private firms is",
    "o": [
      "30% of contract value",
      "40% of contract value",
      "50% of the contract value",
      "20% of the contract value"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "FR 22(1)(a)(1), applies when a government servant is:",
    "o": [
      "Appointed to a post carrying greater duties and responsibilities",
      "Appointed to a post carrying lower duties and responsibilities",
      "Appointed to a post carrying equal duties and responsibilities",
      "Deputed to a Foreign Service post"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which of the following is not a valid option for a Reporting Officer to record remarks in the \"Integrity\" column of an APAR?",
    "o": [
      "Beyond doubt",
      "Since the integrity of the officer is doubtful, a secret note is attached",
      "Not watched the officer's work for sufficient time to form a definite judgement but nothing adverse has been reported to me about the officer",
      "Integrity satisfactory, requires improvement"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "When casual workers perform the same nature of work as regular employees, their daily wage should be calculated as:",
    "o": [
      "1/30 of the minimum pay of the relevant scale plus dearness allowance for 8 hours work.",
      "1/30 of the minimum pay of the relevant scale plus dearness allowance for 8 hours work.",
      "1/30 of the maximum pay of the relevant scale without dearness allowance for 8 hours of work.",
      "1/30 of the average pay of the relevant scale plus dearness allowance for 9 hours work."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "FR 35 allows the government to fix the pay of an officiating Government Servant:",
    "o": [
      "With reference to the minimum pay necessary to secure the services of a person capable of discharging efficiently the duties of the post.",
      "At an amount less than normally admissible.",
      "Not exceeding the lowest stage of that time scale and future increments not exceeding those of the sanctioned scale",
      "With regard to the existing pay of government servants of a status sufficient to warrant their selection for the post."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under Rule 37 of GFR, an officer shall be held personally responsible for:",
    "o": [
      "Losses arising from fraud or negligence of any subordinate officer, even without contribution from the officer",
      "Losses sustained by the Government through fraud or negligence on his part",
      "Losses sustained by other departments without his involvement",
      "None of the above"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under Rule 7(2) of CCS (Implementation of National Pension System) Rules 2021, Government contribution to NPS is not payable for which of the following situations?",
    "o": [
      "Period of earned leave availed during the service of the government servant",
      "Period when the subscriber is not required to contribute under the rules",
      "Period of pay reduction of the government servant",
      "None of the above"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Government dues that can be adjusted against retirement gratuity under CCS (Pension) Rules include:",
    "o": [
      "Dues for unauthorized subletting of Government accommodation,",
      "Overpayment of pay and allowances",
      "Dues for transfer of Government accommodation to an ineligible officer",
      "All of the above"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which of the following statement is true with respect to Fundamental Rules 31A",
    "o": [
      "The authority which orders the transfer of a government servant as a penalty from a higher to a lower grade or post may allow him to draw any pay, not exceeding the maximum of the lower grade or post, which it may think proper.",
      "If the pay of the government servant is reduced as a measure of penalty to a lower stage in his time scale, the authority ordering such reduction shall state the period for which it shall be effective and whether, restoration the period of reduction shall operate to postpone future increments and, if so, to what extent.",
      "The original file number or reference of the sanction is changed",
      "The pay of a government servant whose promotion or appointment to a post is found to be or to have been erroneous shall be regulated in accordance with any orders issued by the President in this behalf."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "If an unmarried government servant has made a nomination in favor of an eligible family member as prescribed under CCS Pension Rules, what happens to the nomination after the Government servant gets married?",
    "o": [
      "The nomination automatically becomes invalid from the date of registration of marriage",
      "The nomination remains valid unless the government servant cancels it and submits a fresh one",
      "The nomination is transferred to the spouse automatically from the date of registration of marriage",
      "The nomination is partially valid for half the amount from the date of registration of marriage"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "As per Rule 171(ii) of GFR, Performance Security should remain valid for a period of days beyond the date of completion of all contractual obligations of the supplier",
    "o": [
      "30 days",
      "45 days",
      "50 days",
      "60 days"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Fundamental Rules (FR) 24, governs that",
    "o": [
      "A Government Servant's lien on a post may in no circumstances be terminated, if the result will be to leave him without a lien upon a regular post.",
      "An officer shall begin to draw the pay and allowances attached to his tenure of a post with effect from the date when he assumes the duties of that post, and shall cease to draw them as soon as he ceases to discharge those duties.",
      "The pay of a Government Servant who is appointed as a probationer in another service or cadre and subsequently confirmed in that service or cadre.",
      "An increment shall ordinarily be drawn as a matter of course unless it is withheld."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Invalid Gratuity under NPS is not applicable in which of the following scenarios?",
    "o": [
      "The Government servant retires due to bodily infirmity and opted for NPS,",
      "The Government servant is permanently incapacitated for service and had opted for NPS",
      "Both A and B",
      "The Government servant retires due to mental infirmity but had opted for Central Civil Services Pension Rules."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "When the service records of a deceased Government servant are incomplete and cannot be fully verified, the death gratuity is determined according to which rule of the Central Civil Services (Payment of Gratuity under National Pension System) Rules, 2021?",
    "o": [
      "Rule 49",
      "Rule 50",
      "Rule 51",
      "Rule 52"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Which of the following categories of pension makes a retired government servant eligible to commute a percentage of pension without medical examination, subject to Rule 5 limits under CCS (Commutation of Pension) Rules?",
    "o": [
      "Superannuation pension under Rule 35 of the pension rules",
      "Retiring pension under Rule 36 of the pension rules",
      "Compensation pension on abolition of permanent post under Rule 39 of pension rules",
      "All of the above"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which circumstance may amount to sexual harassment, even if the explicit acts are absent?",
    "o": [
      "Humiliating treatment likely to affect health/safety",
      "Absence from work",
      "Salary deduction",
      "Transfer from one office to another on administrative grounds"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "All Gramin Dak Sevaks are eligible for the benefits of Circle Welfare Fund for Gramin Dak Sevaks, provided:",
    "o": [
      "They have completed more than three years in GDS and engagement orders are on record.",
      "They have been regularly engaged by the competent authority and engagement orders are on record.",
      "They have completed more than one year in GDS and engagement orders are on record.",
      "They have completed more than five years in GDS and engagement orders are on record."
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013, if the aggrieved woman is unable to make a complaint due to physical or mental incapacity, death, or otherwise, who is permitted to make the complaint?",
    "o": [
      "Her immediate supervisor",
      "Any co-worker or close friend of the aggrieved woman",
      "Her legal heir or any other prescribed person",
      "Only the Internal Complaints Committee or a member of that committee"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "What is expressly prohibited as the basis for conciliation of a sexual harassment case under the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013?",
    "o": [
      "Transfer of complainant",
      "Monetary settlement",
      "Written apology",
      "Warning"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Find the missing number:\n3, 9, 27, 81, ?",
    "o": [
      "162",
      "243",
      "324",
      "729"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Goods and Services Tax in India is collected at which point",
    "o": [
      "Point of production",
      "Point of sale",
      "Point of consumption",
      "Point of export"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The duties and responsibilities of Disbursing and Controlling Officers with regard to contingent expenditure are defined in which of the following rules of FHB Vol I?",
    "o": [
      "Rule 21 and 243",
      "Rule 250 and 251",
      "Rule 159 and 160",
      "Rule 200 and 201"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "What is the amount of scholarship granted to SC/ST employees for appearing Departmental examinations for promotion to the cadre of IPO/IRM/AAO?",
    "o": [
      "₹1800",
      "₹1200",
      "₹5000",
      "₹1200"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "If an officer's APAR is graded between 8 and 10, how will it be treated for the purpose of calculating average scores for empanelment or promotion?",
    "o": [
      "Rated as \"Very Good\" and given a score of 8.5",
      "Rated as \"Outstanding\" and given a score of 9",
      "Rated as \"Excellent\" and given a score of 10",
      "Rated as \"Good\" and given a score equal to the actual APAR grade"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Persons on daily wages (casual workers) should not be engaged for:",
    "o": [
      "Temporary work for a few days",
      "Emergency duties",
      "Work of a regular nature",
      "Seasonal assignments"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The headquarters of the International Court of Justice (ICJ) is at:",
    "o": [
      "Geneva",
      "New York",
      "The Hague",
      "Vienna"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which of the following is NOT a power of the Internal Committee during an inquiry under the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013?",
    "o": [
      "Summoning and production of documents",
      "Summoning witnesses",
      "Imposing direct punishment",
      "Examining persons on oath"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Rule 33 of GFR Rules relates to",
    "o": [
      "Loss of immovable property by fire, flood etc",
      "Prompt disposal of cases of loss",
      "Standards of Financial Propriety",
      "Report of Losses"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "The \"Ring of Fire,\" known for frequent earthquakes and volcanoes, surrounds which ocean?",
    "o": [
      "Atlantic Ocean",
      "Indian Ocean",
      "Pacific Ocean",
      "Arctic Ocean"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "A team member repeatedly submits late reports despite reminders. Which interpersonal approach is most likely to maintain rapport and correct the behavior?",
    "o": [
      "Point out the delays in the next team meeting and request for timely submission of reports.",
      "Reassign all his tasks immediately to a punctual team member to avoid such more delay.",
      "Ignore the issue so as to maintain peace and avoid conflict or trigger tension in the meetings.",
      "Schedule a private conversation, describe the impact of the delays, and agree on a realistic timeline together."
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which provision ensures confidentiality of the complaint and inquiry proceedings under Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act 2013?",
    "o": [
      "Section 15 of the Act",
      "Section 16 of the Act",
      "Section 3 of the Act",
      "Annual report"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "If in a code, LOGIC is written as MPHJD, how is BRAIN written?",
    "o": [
      "CSBJO",
      "CTCJO",
      "CSBJM",
      "CTBJO"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Pradhan Mantri Virasat Ka Samvardhan (PM VIKAS) is a flagship scheme of which ministry?",
    "o": [
      "Ministry of Tribal Affairs",
      "Ministry of Finance",
      "Ministry of Rural Development",
      "Ministry of Minority Affairs"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "The Bibek Debroy Committee was associated with which one of the following?",
    "o": [
      "Road Safety",
      "Indian Railways",
      "Financial Inclusion",
      "Environmental protection"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Fully Vouched Contingencies means",
    "o": [
      "To comprise contingent charges, which require neither special sanction nor countersignature, but may be incurred by the Head of the Office on his own authority subject to the necessity of accounting for them.",
      "Those for which a lump sum is placed annually at the disposal of a Disbursing Officer for expenditure without further sanction of any kind.",
      "To include such contingent charges as may require the approval of some controlling authority before they can be admitted as legitimate expenditure against the Government, such approval usually taking the form of counter signature after payment on a detailed bill submitted to the Account Officer.",
      "To include such contingent charges, whether recurring or non-recurring and cannot be incurred without the previous sanction of a superior authority."
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Find the next number:\n3, 6, 18, 72,?",
    "o": [
      "144",
      "216",
      "288",
      "360"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "Which ministry is responsible for implementing \"Global Engagement Scheme\"?",
    "o": [
      "Ministry of Education",
      "Ministry of Tourism",
      "Ministry of Culture",
      "Ministry of External affairs"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The CRISPR-Cas9 system is primarily used for:",
    "o": [
      "Weather prediction",
      "Genome editing",
      "Data encryption",
      "Space navigation"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Which platform is used by SDBS for registration, record-keeping, and funds management?",
    "o": [
      "New Pension Scheme (NPS)",
      "NPS-Lite scheme",
      "Atal Pension Yojana Scheme (APY)",
      "Pradhan Mantri Jeevan Jyothi Bima Yojana"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Under the Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act 2013, action during the pendency of inquiry can include:",
    "o": [
      "Granting leave to the aggrieved woman up to three months",
      "Awarding punishment to the respondent immediately",
      "Publishing the inquiry details",
      "None of the above"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which organization introduced the Single Girl Child Merit Scholarship Scheme?",
    "o": [
      "Central Board of Secondary Education (CBSE)",
      "National Council of Educational Research and Training (NCERT)",
      "University Grants Commission (UGC)",
      "Ministry of Education"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "The 2025 Union Budget of India set the fiscal deficit target at",
    "o": [
      "3.5% of GDP",
      "4.4% of GDP",
      "5.2% of GDP",
      "4.8% of GDP"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "If a person is aggrieved by the recommendations of Internal Complaints Committee under Section 13, 14, or 17 of Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act 2013, which of the following is correct?",
    "o": [
      "They may appeal to the court or tribunal as per service rules applicable to the said person",
      "If no service rules exist, they may appeal in such manner as may be prescribed",
      "Both (A) and (B)",
      "There is no provision for appeal"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "What happens when a GDS is absorbed into a regular departmental post?",
    "o": [
      "They must exit the SDBS and transfer their accumulations to the NPS",
      "They continue contributing to SDBS without changes",
      "They forfeit all accumulations",
      "They can choose to leave the scheme or stay"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Under Circle Welfare Fund for GDS, the GDS will be eligible for loan at lower rate of interest of 5% per annum deductible in maximum instalments",
    "o": [
      "10",
      "15",
      "20",
      "25"
    ],
    "a": 3,
    "e": "Correct Answer: D"
  },
  {
    "q": "A GDS having 10 years from the date of start of contribution and has not claimed any kind of assistance or grant from Circle Welfare Contributory Fund in his entire service can be paid a lump sum on discharge at the rate as follows:",
    "o": [
      "₹2000",
      "₹1000",
      "₹5000",
      "₹3000"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Which of the following facilities are extended for Magazine post:",
    "o": [
      "Advance payment facility",
      "Volume discount under BNPL scheme",
      "Rebate under scheme of advance payment",
      "None of the above"
    ],
    "a": 0,
    "e": "Correct Answer: A"
  },
  {
    "q": "Average age of 30 students is 15 years. If 5 students with average age 10 years leave the group, what is the average age of remaining students?",
    "o": [
      "15 years",
      "14 years",
      "16 years",
      "13 years"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "A train 150 m long crosses a platform 300 m long in 40 seconds. Find the speed of the train in",
    "o": [
      "",
      "",
      "",
      ""
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Select the word nearest in meaning to \"obfuscate\"",
    "o": [
      "Clarify",
      "Complicate",
      "Illuminate",
      "Simplify"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Fill in the blank with the most suitable word:\n\"The scientist's explanation was so ... that even experts struggled to follow it.\"",
    "o": [
      "lucid",
      "recondite",
      "pellucid",
      "articulate"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Read the short passage and answer:\nAlthough social media connects people across the globe, studies show excessive use can lead to feelings of isolation. Striking a balance is crucial to maintain real-world relationship.\nThe author's primary concern is:",
    "o": [
      "Promoting global connectivity",
      "Highlighting dangers of social media overuse",
      "Advocating for banning social media",
      "Explaining how to use social media for business"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "[INSTRUCTION]: Read the following passage and answer questions from 143 to 150\nIndia, as one of the world's fastest-growing economies, faces the dual challenge of sustaining economic growth while addressing environmental concerns. Its participation in global environmental protocols reflects an effort to balance these goals. India is a signatory to major international agreements such as the Paris Agreement (2015), the Montreal Protocol (1987), and the Convention on Biological Diversity (1992). Under the Paris Agreement, India committed to reducing the emissions intensity of its GDP by 33-35% by 2030 (from 2005 levels) and pledged that 40% of its installed power capacity would come from non-fossil fuel sources. This commitment has been enhanced with India's Nationally Determined Contributions (NDCs), which now target net-zero emissions by 2070. Progress is visible: renewable energy capacity has crossed 170 GW, and large-scale solar projects such as the International Solar Alliance highlight India's leadership role. The Montreal Protocol, aimed at phasing out ozone-depleting substances (ODS), is another success story for India. The country has phased out chlorofluorocarbons (CFCs) ahead of schedule and is now working on reducing hydrochlorofluorocarbons (HCFCs) and hydrofluorocarbons (HFCs) under the Kigali Amendment. This transition is not merely environmental but also technological, requiring industries to adopt alternative cooling and refrigeration systems. India has also aligned itself with biodiversity conservation goals. As a party to the Convention on Biological Diversity, it has launched initiatives such as the National Biodiversity Action Plan and the People's Biodiversity Registers at local levels. However, rapid urbanization, deforestation, and habitat loss remain significant challenges, threatening species survival despite policy efforts. Critics argue that while India is making progress, it faces implementation gaps due to limited financial resources, competing developmental priorities, and the need for capacity building. Nonetheless India's consistent participation in global environmental frameworks demonstrates its recognition that climate change and biodiversity loss are transnational problems requiring collective action. The country's approach reflects both pragmatism - balancing energy security and growth and leadership, particularly among developing nations advocating for climate justice.\n\n India's net-zero emissions target year, as per updated NDCs, is:",
    "o": [
      "2050",
      "2060",
      "2070",
      "2080"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which of the following best describes India's commitments under the Paris Agreement?",
    "o": [
      "Achieving net-zero emissions by 2030",
      "Reducing GDP growth to lower emissions",
      "Reducing emission intensity and increasing non-fossil fuel energy capacity",
      "Eliminating all fossil fuels by 2050"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "The Montreal Protocol primarily deals with:",
    "o": [
      "Biodiversity and habitat loss",
      "Ozone-depleting substances",
      "Greenhouse gas taxation",
      "Renewable energy transition"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "The term \"implementation gap\" in India's environmental commitments refers to:",
    "o": [
      "Lack of international agreements signed by India regionally and globally",
      "India's refusal to cooperate with UN agencies on environment",
      "Challenges in meeting targets due to financial and capacity constraints",
      "Implementation gaps and reduction in biodiversity registers at local levels"
    ],
    "a": 2,
    "e": "Correct Answer: C"
  },
  {
    "q": "Which of the following initiatives by the country is linked to India's commitment under the Convention on Biological Diversity?",
    "o": [
      "International Solar Alliance",
      "National Biodiversity Action Plan",
      "Kigali Amendment",
      "Paris Agreement"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "The phrase \"transnational problems requiring collective action\" refers to:",
    "o": [
      "Energy security and food subsidies",
      "Climate change and biodiversity loss",
      "Rural employment and poverty alleviation",
      "Ozone-friendly refrigeration exports"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "From the passage, which sector is MOST affected by the Montreal Protocol in India?",
    "o": [
      "Transport and logistics industry",
      "Cooling and refrigeration industries",
      "Forest and Environment",
      "Agriculture and allied industry"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  },
  {
    "q": "Based on the passage, which of the following best summarizes India's environmental approach?",
    "o": [
      "Prioritizing economic growth over climate concerns",
      "Leading in renewable energy while facing challenges in implementation",
      "Refusing global cooperation but building local projects",
      "Eliminating biodiversity concerns to focus on ozone issues"
    ],
    "a": 1,
    "e": "Correct Answer: B"
  }
]